{"config": [{"config": {"input_dtype": "float32", "arguments": {}, "batch_input_shape": [null, 64, 64, 3], "function_type": "lambda", "output_shape_type": "raw", "trainable": true, "output_shape": [64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa2/home/marcos/selfdriving/simulator-linux/models.py\u00da\b<lambda>(\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"nb_filter": 24, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "trainable": true, "subsample": [2, 2], "name": "convolution2d_1", "nb_col": 5, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [1, 1], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 36, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "trainable": true, "subsample": [2, 2], "name": "convolution2d_2", "nb_col": 5, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [1, 1], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 48, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "trainable": true, "subsample": [2, 2], "name": "convolution2d_3", "nb_col": 5, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [1, 1], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 64, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "trainable": true, "subsample": [1, 1], "name": "convolution2d_4", "nb_col": 3, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [1, 1], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 64, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "trainable": true, "subsample": [1, 1], "name": "convolution2d_5", "nb_col": 3, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "strides": [1, 1], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_5"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "name": "dense_1", "bias": true, "output_dim": 1164, "input_dim": 1600, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "name": "dense_2", "bias": true, "output_dim": 100, "input_dim": 1164, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "name": "dense_3", "bias": true, "output_dim": 50, "input_dim": 100, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "name": "dense_4", "bias": true, "output_dim": 10, "input_dim": 50, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "name": "dense_5", "bias": true, "output_dim": 1, "input_dim": 10, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}