{"keras_version": "1.2.0", "config": [{"config": {"output_shape": [64, 64, 3], "batch_input_shape": [null, 64, 64, 3], "trainable": true, "name": "lambda_1", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa2/home/marcos/selfdriving/simulator-linux/models.py\u00da\b<lambda>\u000b\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "arguments": {}, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "nb_row": 8, "name": "convolution2d_1", "nb_filter": 16, "bias": true, "W_constraint": null, "nb_col": 8, "activity_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [4, 4], "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "nb_row": 3, "name": "convolution2d_2", "nb_filter": 32, "bias": true, "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "nb_row": 5, "name": "convolution2d_3", "nb_filter": 32, "bias": true, "W_constraint": null, "nb_col": 5, "activity_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "nb_row": 3, "name": "convolution2d_4", "nb_filter": 64, "bias": true, "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "nb_row": 5, "name": "convolution2d_5", "nb_filter": 64, "bias": true, "W_constraint": null, "nb_col": 5, "activity_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_1", "bias": true, "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "input_dim": 64, "output_dim": 400, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_2", "bias": true, "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "input_dim": 400, "output_dim": 100, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_3", "bias": true, "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "input_dim": 100, "output_dim": 20, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_4", "bias": true, "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "input_dim": 20, "output_dim": 1, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}