{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa2/home/marcos/selfdriving/simulator-linux/models.py\u00da\b<lambda>(\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "function_type": "lambda", "input_dtype": "float32", "output_shape": [64, 64, 3]}}, {"class_name": "Convolution2D", "config": {"bias": true, "border_mode": "same", "nb_row": 5, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "nb_filter": 24, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"bias": true, "border_mode": "same", "nb_row": 5, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "nb_filter": 36, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"bias": true, "border_mode": "same", "nb_row": 5, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "nb_filter": 48, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_3", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"bias": true, "border_mode": "same", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_4", "nb_filter": 64, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "dim_ordering": "tf", "nb_col": 3, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_4", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"bias": true, "border_mode": "same", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_5", "nb_filter": 64, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "dim_ordering": "tf", "nb_col": 3, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_5", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "input_dim": 1600, "name": "dense_1", "trainable": true, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "output_dim": 1164, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "input_dim": 1164, "name": "dense_2", "trainable": true, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "output_dim": 100, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "input_dim": 100, "name": "dense_3", "trainable": true, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "output_dim": 50, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "input_dim": 50, "name": "dense_4", "trainable": true, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "output_dim": 10, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "input_dim": 10, "name": "dense_5", "trainable": true, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "output_dim": 1, "b_regularizer": null}}]}