{"config": [{"config": {"arguments": {}, "output_shape": [64, 64, 3], "batch_input_shape": [null, 64, 64, 3], "trainable": true, "function_type": "lambda", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa2/home/marcos/selfdriving/simulator-linux/models.py\u00da\b<lambda>\u000b\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "subsample": [4, 4], "nb_filter": 16, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "trainable": true, "nb_row": 8, "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_col": 8, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "subsample": [2, 2], "nb_filter": 32, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "trainable": true, "nb_row": 3, "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_col": 3, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "nb_filter": 32, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "trainable": true, "nb_row": 5, "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_col": 5, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "trainable": true, "nb_row": 3, "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_col": 3, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "subsample": [2, 2], "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "trainable": true, "nb_row": 5, "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_col": 5, "name": "convolution2d_5"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 400, "b_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 64, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 100, "b_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 400, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 20, "b_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 100, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 1, "b_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 20, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}