{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "trainable": true, "name": "lambda_1", "arguments": {}, "output_shape": [160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\btrain.py\u00da\b<lambda>%\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 160, 320, 3], "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "name": "convolution2d_1", "nb_filter": 16, "dim_ordering": "tf", "b_constraint": null, "subsample": [4, 4], "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "nb_col": 8, "activity_regularizer": null, "nb_row": 8}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "name": "convolution2d_2", "nb_filter": 32, "dim_ordering": "tf", "b_constraint": null, "subsample": [2, 2], "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "name": "convolution2d_3", "nb_filter": 32, "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "nb_col": 5, "activity_regularizer": null, "nb_row": 5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "name": "convolution2d_4", "nb_filter": 64, "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "name": "convolution2d_5", "nb_filter": 64, "dim_ordering": "tf", "b_constraint": null, "subsample": [2, 2], "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "nb_col": 5, "activity_regularizer": null, "nb_row": 5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 512, "name": "dense_1", "input_dim": 960, "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 1, "name": "dense_2", "input_dim": 512, "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null}}], "keras_version": "1.2.0"}