{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape_type": "raw", "trainable": true, "output_shape": [64, 64, 3], "function_type": "lambda", "batch_input_shape": [null, 64, 64, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>$\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_row": 8, "activation": "linear", "b_constraint": null, "nb_col": 8, "subsample": [4, 4], "trainable": true, "name": "convolution2d_1", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_row": 3, "activation": "linear", "b_constraint": null, "nb_col": 3, "subsample": [2, 2], "trainable": true, "name": "convolution2d_2", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_row": 5, "activation": "linear", "b_constraint": null, "nb_col": 5, "subsample": [1, 1], "trainable": true, "name": "convolution2d_3", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_row": 3, "activation": "linear", "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": true, "name": "convolution2d_4", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_row": 5, "activation": "linear", "b_constraint": null, "nb_col": 5, "subsample": [2, 2], "trainable": true, "name": "convolution2d_5", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "output_dim": 400, "bias": true, "activation": "linear", "b_constraint": null, "trainable": true, "name": "dense_1", "input_dim": 64, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "output_dim": 100, "bias": true, "activation": "linear", "b_constraint": null, "trainable": true, "name": "dense_2", "input_dim": 400, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "output_dim": 20, "bias": true, "activation": "linear", "b_constraint": null, "trainable": true, "name": "dense_3", "input_dim": 100, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "output_dim": 1, "bias": true, "activation": "linear", "b_constraint": null, "trainable": true, "name": "dense_4", "input_dim": 20, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null}}], "keras_version": "1.2.0"}