{"config": [{"config": {"arguments": {}, "input_dtype": "float32", "name": "lambda_1", "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>$\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": [64, 64, 3], "batch_input_shape": [null, 64, 64, 3]}, "class_name": "Lambda"}, {"config": {"activation": "linear", "name": "convolution2d_1", "trainable": true, "W_regularizer": null, "nb_col": 8, "init": "glorot_uniform", "border_mode": "same", "subsample": [4, 4], "W_constraint": null, "activity_regularizer": null, "nb_filter": 16, "dim_ordering": "tf", "b_constraint": null, "nb_row": 8, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "convolution2d_2", "trainable": true, "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "border_mode": "same", "subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "convolution2d_3", "trainable": true, "W_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "b_constraint": null, "nb_row": 5, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "convolution2d_4", "trainable": true, "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "convolution2d_5", "trainable": true, "W_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "border_mode": "same", "subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "b_constraint": null, "nb_row": 5, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "dense_1", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 400, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "input_dim": 64, "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "dense_2", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 100, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "input_dim": 400, "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "dense_3", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 20, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "input_dim": 100, "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_8", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "dense_4", "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "input_dim": 20, "b_regularizer": null, "bias": true}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}