{"keras_version": "1.2.0", "config": [{"config": {"trainable": true, "output_shape": [64, 64, 3], "function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>$\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}, "class_name": "Lambda"}, {"config": {"nb_filter": 24, "nb_col": 5, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "activity_regularizer": null, "bias": true, "nb_row": 5, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_1", "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [1, 1], "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 36, "nb_col": 5, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "activity_regularizer": null, "bias": true, "nb_row": 5, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_2", "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [1, 1], "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 48, "nb_col": 5, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "activity_regularizer": null, "bias": true, "nb_row": 5, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_3", "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [1, 1], "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 64, "nb_col": 3, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_4", "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [1, 1], "name": "maxpooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 64, "nb_col": 3, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_5", "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [1, 1], "name": "maxpooling2d_5"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "name": "dense_1", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1164, "input_dim": 1600}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "name": "dense_2", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 100, "input_dim": 1164}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "name": "dense_3", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 50, "input_dim": 100}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "name": "dense_4", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 10, "input_dim": 50}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "name": "dense_5", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1, "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential"}