{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>$\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "input_dtype": "float32", "name": "lambda_1", "output_shape": [64, 64, 3], "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "arguments": {}}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [4, 4], "W_regularizer": null, "name": "convolution2d_1", "bias": true, "init": "glorot_uniform", "nb_col": 8, "trainable": true, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_row": 8, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_2", "bias": true, "init": "glorot_uniform", "nb_col": 3, "trainable": true, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_3", "bias": true, "init": "glorot_uniform", "nb_col": 5, "trainable": true, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_4", "bias": true, "init": "glorot_uniform", "nb_col": 3, "trainable": true, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_5", "bias": true, "init": "glorot_uniform", "nb_col": 5, "trainable": true, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "b_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_1", "trainable": true, "activity_regularizer": null, "input_dim": 64, "output_dim": 400, "W_constraint": null, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_2", "trainable": true, "activity_regularizer": null, "input_dim": 400, "output_dim": 100, "W_constraint": null, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_3", "trainable": true, "activity_regularizer": null, "input_dim": 100, "output_dim": 20, "W_constraint": null, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_4", "trainable": true, "activity_regularizer": null, "input_dim": 20, "output_dim": 1, "W_constraint": null, "b_regularizer": null, "b_constraint": null}}]}