{"config": [{"config": {"output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "trainable": true, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa2/home/marcos/selfdriving/simulator-linux/models.py\u00da\b<lambda>(\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 64, 3], "output_shape": [64, 64, 3], "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "dim_ordering": "tf", "bias": true, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_1", "nb_filter": 24, "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "dim_ordering": "tf", "bias": true, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_2", "nb_filter": 36, "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "dim_ordering": "tf", "bias": true, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_3", "nb_filter": 48, "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "bias": true, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_4", "nb_filter": 64, "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "bias": true, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_5", "nb_filter": 64, "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_5"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "b_constraint": null, "output_dim": 100, "trainable": true, "bias": true, "W_regularizer": null, "name": "dense_1", "input_dim": 1600, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "b_constraint": null, "output_dim": 50, "trainable": true, "bias": true, "W_regularizer": null, "name": "dense_2", "input_dim": 100, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "b_constraint": null, "output_dim": 10, "trainable": true, "bias": true, "W_regularizer": null, "name": "dense_3", "input_dim": 50, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "b_constraint": null, "output_dim": 1, "trainable": true, "bias": true, "W_regularizer": null, "name": "dense_4", "input_dim": 10, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}