{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa2/home/marcos/selfdriving/simulator-linux/models.py\u00da\b<lambda>(\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape": [64, 64, 3], "function_type": "lambda", "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_filter": 24, "bias": true, "W_constraint": null, "activity_regularizer": null, "nb_col": 5, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_filter": 36, "bias": true, "W_constraint": null, "activity_regularizer": null, "nb_col": 5, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_filter": 48, "bias": true, "W_constraint": null, "activity_regularizer": null, "nb_col": 5, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "border_mode": "valid", "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_filter": 64, "bias": true, "W_constraint": null, "activity_regularizer": null, "nb_col": 3, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "border_mode": "valid", "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_filter": 64, "bias": true, "W_constraint": null, "activity_regularizer": null, "nb_col": 3, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_5", "border_mode": "valid", "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "input_dim": 1600, "b_constraint": null, "trainable": true, "W_constraint": null, "bias": true, "output_dim": 100, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "input_dim": 100, "b_constraint": null, "trainable": true, "W_constraint": null, "bias": true, "output_dim": 50, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "input_dim": 50, "b_constraint": null, "trainable": true, "W_constraint": null, "bias": true, "output_dim": 10, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "input_dim": 10, "b_constraint": null, "trainable": true, "W_constraint": null, "bias": true, "output_dim": 1, "activity_regularizer": null, "b_regularizer": null}}], "keras_version": "1.2.0"}