{"keras_version": "1.2.0", "config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa2/home/marcos/selfdriving/simulator-linux/models.py\u00da\b<lambda>\u000b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "output_shape": [160, 320, 3], "output_shape_type": "raw", "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "trainable": true}, "class_name": "Lambda"}, {"config": {"bias": true, "nb_col": 8, "name": "convolution2d_1", "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "subsample": [4, 4], "W_regularizer": null, "W_constraint": null, "nb_row": 8, "dim_ordering": "tf", "activation": "linear", "trainable": true, "nb_filter": 16, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "nb_col": 3, "name": "convolution2d_2", "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "activation": "linear", "trainable": true, "nb_filter": 32, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "nb_col": 5, "name": "convolution2d_3", "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "activation": "linear", "trainable": true, "nb_filter": 32, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "nb_col": 3, "name": "convolution2d_4", "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "activation": "linear", "trainable": true, "nb_filter": 64, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "nb_col": 5, "name": "convolution2d_5", "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "activation": "linear", "trainable": true, "nb_filter": 64, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "b_constraint": null, "name": "dense_1", "b_regularizer": null, "input_dim": 960, "W_regularizer": null, "W_constraint": null, "activation": "linear", "output_dim": 100, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "b_constraint": null, "name": "dense_2", "b_regularizer": null, "input_dim": 100, "W_regularizer": null, "W_constraint": null, "activation": "linear", "output_dim": 20, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "b_constraint": null, "name": "dense_3", "b_regularizer": null, "input_dim": 20, "W_regularizer": null, "W_constraint": null, "activation": "linear", "output_dim": 1, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}