{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "input_dtype": "float32", "output_shape": [160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\btrain.py\u00da\b<lambda>-\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [4, 4], "name": "convolution2d_1", "border_mode": "same", "nb_col": 8, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "nb_filter": 16, "b_constraint": null, "nb_row": 8}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [2, 2], "name": "convolution2d_2", "border_mode": "same", "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "nb_filter": 32, "b_constraint": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_3", "border_mode": "same", "nb_col": 5, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "nb_filter": 32, "b_constraint": null, "nb_row": 5}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_4", "border_mode": "same", "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "nb_filter": 64, "b_constraint": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [2, 2], "name": "convolution2d_5", "border_mode": "same", "nb_col": 5, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "nb_filter": 64, "b_constraint": null, "nb_row": 5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 512, "input_dim": 960, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 1, "input_dim": 512, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "b_constraint": null, "trainable": true}}]}